jscrane/attiny/avr/boards.txt
menu.cpu=Processor
menu.clock=Clock

attiny.name=ATtiny
attiny.bootloader.tool=arduino:avrdude
attiny.bootloader.unlock_bits=0xff
attiny.bootloader.lock_bits=0xff
attiny.build.core=arduino:arduino
attiny.build.board=attiny
attiny.upload.tool=arduino:avrdude

attiny.menu.cpu.attiny45=ATtiny45
attiny.menu.cpu.attiny45.upload.maximum_size=4096
attiny.menu.cpu.attiny45.build.mcu=attiny45
attiny.menu.cpu.attiny45.build.variant=tiny8

attiny.menu.cpu.attiny85=ATtiny85
attiny.menu.cpu.attiny85.upload.maximum_size=8192
attiny.menu.cpu.attiny85.build.mcu=attiny85
attiny.menu.cpu.attiny85.build.variant=tiny8

attiny.menu.cpu.attiny44=ATtiny44
attiny.menu.cpu.attiny44.upload.maximum_size=4096
attiny.menu.cpu.attiny44.build.mcu=attiny44
attiny.menu.cpu.attiny44.build.variant=tiny14

attiny.menu.cpu.attiny84=ATtiny84
attiny.menu.cpu.attiny84.upload.maximum_size=8192
attiny.menu.cpu.attiny84.build.mcu=attiny84
attiny.menu.cpu.attiny84.build.variant=tiny14

attiny.menu.clock.internal1=1 MHz (internal)
attiny.menu.clock.internal1.bootloader.low_fuses=0x62
attiny.menu.clock.internal1.bootloader.high_fuses=0xdf
attiny.menu.clock.internal1.bootloader.extended_fuses=0xff
attiny.menu.clock.internal1.build.f_cpu=1000000L

attiny.menu.clock.internal8=8 MHz (internal)
attiny.menu.clock.internal8.bootloader.low_fuses=0xe2
attiny.menu.clock.internal8.bootloader.high_fuses=0xdf
attiny.menu.clock.internal8.bootloader.extended_fuses=0xff
attiny.menu.clock.internal8.build.f_cpu=8000000L

attiny.menu.clock.external8=8 MHz (external)
attiny.menu.clock.external8.bootloader.low_fuses=0xfe
attiny.menu.clock.external8.bootloader.high_fuses=0xdf
attiny.menu.clock.external8.bootloader.extended_fuses=0xff
attiny.menu.clock.external8.build.f_cpu=8000000L

attiny.menu.clock.external16=16 MHz (external)
attiny.menu.clock.external16.bootloader.low_fuses=0xfe
attiny.menu.clock.external16.bootloader.high_fuses=0xdf
attiny.menu.clock.external16.bootloader.extended_fuses=0xff
attiny.menu.clock.external16.build.f_cpu=16000000L

attiny.menu.clock.external20=20 MHz (external)
attiny.menu.clock.external20.bootloader.low_fuses=0xfe
attiny.menu.clock.external20.bootloader.high_fuses=0xdf
attiny.menu.clock.external20.bootloader.extended_fuses=0xff
attiny.menu.clock.external20.build.f_cpu=20000000L

t84db.name=ATtiny84 Dev Board
t84db.build.mcu=attiny84
t84db.build.f_cpu=8000000L
t84db.build.core=arduino:arduino
t84db.build.variant=tiny14
t84db.build.board=t84db

t84db.upload.tool=tsb
t84db.upload.protocol=arduinoisp
t84db.upload.maximum_size=7552
t84db.upload.speed=9600

t84db.program.tool=arduino:avrdude
t84db.program.protocol=arduinoisp
t84db.program.maximum_size=8192
t84db.program.speed=19200

t84db.erase.tool=arduino:avrdude
t84db.erase.protocol=arduinoisp
t84db.erase.maximum_size=8192
t84db.erase.speed=19200

t84db.bootloader.tool=arduino:avrdude
t84db.bootloader.protocol=arduinoisp
t84db.bootloader.speed=19200
t84db.bootloader.low_fuses=0xe2
t84db.bootloader.high_fuses=0xdf
t84db.bootloader.extended_fuses=0xfe
t84db.bootloader.file=tsb/tsb_tn84_b1b0_20131023.hex

t85db.name=ATtiny85 Dev Board
t85db.build.mcu=attiny85
t85db.build.f_cpu=8000000L
t85db.build.core=arduino:arduino
t85db.build.variant=tiny8
t85db.build.board=t85db

t85db.upload.tool=tsb
t85db.upload.protocol=arduinoisp
t85db.upload.maximum_size=7552
t85db.upload.speed=9600

t85db.program.tool=arduino:avrdude
t85db.program.protocol=arduinoisp
t85db.program.maximum_size=8192
t85db.program.speed=19200

t85db.erase.tool=arduino:avrdude
t85db.erase.protocol=arduinoisp
t85db.erase.maximum_size=8192
t85db.erase.speed=19200

t85db.bootloader.tool=arduino:avrdude
t85db.bootloader.protocol=arduinoisp
t85db.bootloader.speed=19200
t85db.bootloader.low_fuses=0xe2
t85db.bootloader.high_fuses=0xdf
t85db.bootloader.extended_fuses=0xfe
t85db.bootloader.file=tsb/tsb_tn85_b4b3_20150308.hex
